app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'ahdagda@gmail.com'
 LIMIT 1
---
    public function check(){

        $validation = $this->validate([

            'email'=>[
                'rules'=>'required|valid_email|is_not_unique[users.email]',
                'errors'=>[
                    'required'=>'Se necesita el correo',
                    'valid_email'=>'Ingrese un correo valido',
                    'is_not_unique'=>'Este correo no se encuentra registrado'
                ]
                ],
                 'password'=>[
                    'rules'=>'required|min_length[5]|max_length[12]',
                    'errors'=>[
                        'required'=>'se necesita la contraseña',
                        'min_length'=>'La contraseña debe tener al menos 5 caracteres',
                        'max_length'=>'la contraseña debe ser menor a 12 caracteres',
                ]
                ]
        ]);

        if(!$validation){
            return view('login/login',['validation'=>$this->validator]);
        }else{

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $usersModel = new \App\Models\UserModel();
            $user_info = $usersModel->where('email', $email)->first();