app/Controllers/Login.php

SELECT *
FROM `personas`
WHERE `correo_personas` = 'jesusecb11@gmail.com'
 LIMIT 1
---
    public function check(){

        $validation = $this->validate([

            'correo_personas'=>[
                'rules'=>'required|valid_email|is_not_unique[personas.correo_personas]',
                'errors'=>[
                    'required'=>'Se necesita el correo',
                    'valid_email'=>'Ingrese un correo valido',
                    'is_not_unique'=>'Este correo no se encuentra registrado'
                ]
                ],
                 'clave'=>[
                    'rules'=>'required|min_length[5]|max_length[12]',
                    'errors'=>[
                        'required'=>'se necesita la contraseña',
                        'min_length'=>'La contraseña debe tener al menos 5 caracteres',
                        'max_length'=>'la contraseña debe ser menor a 12 caracteres',
                ]
                ]
        ]);

        if(!$validation){
            return view('login/login',['validation'=>$this->validator]);
        }else{

            $email = $this->request->getPost('correo_personas');
            $password = $this->request->getPost('clave');

            $usersModel = new \App\Models\personasModel();
            $user_info = $usersModel->where('correo_personas', $email)->first();

SELECT *
FROM `roles`
WHERE `roles`.`id` = '2'
---
                // Obtener el rol del usuario desde la tabla roles
            $rol_personas = $user_info['rol_personas'];
            $rolesModel = new RoleModel(); // Suponiendo que tienes un modelo para la tabla roles
            $role_info = $rolesModel->find($rol_personas);