app/Controllers/Register.php

INSERT INTO `users` (`name`, `surname`, `email`, `password`) VALUES ('Jesus', 'Cabello', 'ghostdreemurr@gmail.com', '$2y$10$TA/v8pAZwTzS5PrHPUW..OVPtHqiEPq36763Ml2E6oHe9rPsj6px.')
---

            //insercion de datos en la db
            $usersModel = new \App\Models\UserModel();
            $querry = $usersModel->insert($values);